<?php

namespace Database\Seeders;

use App\Models\Image;
use App\Models\Post;
use App\Models\Video;
use Illuminate\Database\Seeder;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        Post::create([
            'post_title' => "প্রস্তুতি শেষ না করেই টরন্টো ফ্লাইটের নতুন তারিখ দিল বিমান",
            'link' => "https://www.prothomalo.com/bangladesh/1qttezwj07",
            'featured_image' => "/common/images/gallery/1.jpg",

            'post_details' => "ঢাকা-টরন্টো ফ্লাইট উদ্বোধনের ৯ সপ্তাহ পর এসে বিমান বাংলাদেশ এয়ারলাইনস জানাচ্ছে, ২৮ জুন কানাডার টরন্টোয় ফ্লাইট পরিচালনা শুরু করবে। গতকাল বুধবার সাংবাদিকদের সঙ্গে এক মতবিনিময় সভায় বিমানের ব্যবস্থাপনা পরিচালক (এমডি) নতুন এই তারিখের কথা জানান।
                                এর আগে গত ২৬ মার্চ আগাম ঘোষণা দিয়ে টরন্টো ফ্লাইট উদ্বোধন করেছিল বিমান। কিন্তু প্রয়োজনীয় সব প্রস্তুতি সম্পন্ন না করেই ফ্লাইট চালুর ঘোষণা দেয়। ফলে উদ্বোধনী ফ্লাইটকে ‘পরীক্ষামূলক বাণিজ্যিক ফ্লাইট’ আখ্যা দিয়ে একটি ফ্লাইট ওই দিন আনুষ্ঠানিকতার মধ্য দিয়ে টরন্টো পাঠানো হয়। ওই ফ্লাইটের পেছনে খরচ হয়েছিল প্রায় চার কোটি টাকা।",

        ]);
        Post::create([
            'post_title' => "মহামারির মধ্যে দেশে করোনায় সর্বনিম্ন মৃত্যু মে মাসে",
            'link' => "https://www.prothomalo.com/bangladesh/1qttezwj07",
            'featured_image' => "/common/images/gallery/1.jpg",
            'post_details' => "ঢাকা-টরন্টো ফ্লাইট উদ্বোধনের ৯ সপ্তাহ পর এসে বিমান বাংলাদেশ এয়ারলাইনস জানাচ্ছে, ২৮ জুন কানাডার টরন্টোয় ফ্লাইট পরিচালনা শুরু করবে। গতকাল বুধবার সাংবাদিকদের সঙ্গে এক মতবিনিময় সভায় বিমানের ব্যবস্থাপনা পরিচালক (এমডি) নতুন এই তারিখের কথা জানান।
                                এর আগে গত ২৬ মার্চ আগাম ঘোষণা দিয়ে টরন্টো ফ্লাইট উদ্বোধন করেছিল বিমান। কিন্তু প্রয়োজনীয় সব প্রস্তুতি সম্পন্ন না করেই ফ্লাইট চালুর ঘোষণা দেয়। ফলে উদ্বোধনী ফ্লাইটকে ‘পরীক্ষামূলক বাণিজ্যিক ফ্লাইট’ আখ্যা দিয়ে একটি ফ্লাইট ওই দিন আনুষ্ঠানিকতার মধ্য দিয়ে টরন্টো পাঠানো হয়। ওই ফ্লাইটের পেছনে খরচ হয়েছিল প্রায় চার কোটি টাকা।",

        ]);
        Post::create([
            'post_title' => "প্রস্তুতি শেষ না করেই টরন্টো ফ্লাইটের নতুন তারিখ দিল বিমান",
            'link' => "https://www.prothomalo.com/bangladesh/1qttezwj07",
            'featured_image' => "/common/images/gallery/1.jpg",

            'post_details' => "ঢাকা-টরন্টো ফ্লাইট উদ্বোধনের ৯ সপ্তাহ পর এসে বিমান বাংলাদেশ এয়ারলাইনস জানাচ্ছে, ২৮ জুন কানাডার টরন্টোয় ফ্লাইট পরিচালনা শুরু করবে। গতকাল বুধবার সাংবাদিকদের সঙ্গে এক মতবিনিময় সভায় বিমানের ব্যবস্থাপনা পরিচালক (এমডি) নতুন এই তারিখের কথা জানান।
                                এর আগে গত ২৬ মার্চ আগাম ঘোষণা দিয়ে টরন্টো ফ্লাইট উদ্বোধন করেছিল বিমান। কিন্তু প্রয়োজনীয় সব প্রস্তুতি সম্পন্ন না করেই ফ্লাইট চালুর ঘোষণা দেয়। ফলে উদ্বোধনী ফ্লাইটকে ‘পরীক্ষামূলক বাণিজ্যিক ফ্লাইট’ আখ্যা দিয়ে একটি ফ্লাইট ওই দিন আনুষ্ঠানিকতার মধ্য দিয়ে টরন্টো পাঠানো হয়। ওই ফ্লাইটের পেছনে খরচ হয়েছিল প্রায় চার কোটি টাকা।",

        ]);

        Video::create([

            'link' => "ueTfCGvpc48",
       ]);
        Video::create([

            'link' => "SR-5lPZLWAQ",
       ]);
        Video::create([

            'link' => "SR-5lPZLWAQ",
       ]);
        Image::create([

            'featured_image' => "/uploads/post/1.webp",
       ]);
        Image::create([

            'featured_image' => "/uploads/post/1.webp",
       ]);
        Image::create([

            'featured_image' => "/uploads/post/1.webp",
       ]);
    }
}
